// #include <iostream>
// using namespace std;

// //建立指標變數, 記憶體位置指向n（必指向一個記憶體裡）,目的在別的記憶體區塊可以控制另一個記憶體區塊的值, 自訂function()內需參數 -> function(int *ptr_n), 呼叫時function(&n) -> 取位址放入自訂function
// //取址運算子 -> ＆一般變數
// //取值運算子 -> *記憶體位址, 使用可控制n值, 可以取值或改變值
// //int* 宣告變數

// int main(){
//   int n = 5; //一般變數, 無法儲存記憶體
//   n = 10;
//   int* ptr_n = &n;

//   *ptr_n = 20; //透過指標變數改變值
//   cout << "n變數內的值=" << n << '\n';
//   cout << "n變數內的值=" << *ptr_n << '\n'; //取值運算子
//   cout << "n的記憶體位址" << ptr_n << '\n'; //指標變數

// //儲存記憶體的變數＝指標變數（需馬上給值'='）
// //指標變數的值是記憶體位址, 一定要指向一個變數, int* ptr_n = &n, (int*為宣告指標變數, ptr_n為變數名稱, 可控制n值)
  
  
// }